
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7932451884)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * google_compute_network.vpc-network
  * google_vpc_access_connector.vpc-connector
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_compute_network.vpc-network will be created
  + resource "google_compute_network" "vpc-network" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "gig-japan-398904"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_vpc_access_connector.vpc-connector will be created
  + resource "google_vpc_access_connector" "vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "20.8.2.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "connector"
      + network            = "vpc-network"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 2 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  + vpc_connector_ip_range = "20.8.2.0/28"
  + vpc_connector_name     = "connector"
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":64,"Program":"tfcmt","SHA1":"67fc2b2e1d7359a6b21a1c47418c5cd18512c9e1","Vars":{},"WorkflowName":"iaac_plan"} -->